NeKarakasis/MC_Greece/RA6T2_MCIHV1_IPM_LESS_FOC_WHOLE_PFC_E2S_V100/ra_gen/hal_data.c
const timer_cfg_t g_timer_gpt4_cfg =
		{ .mode = TIMER_MODE_TRIANGLE_WAVE_SYMMETRIC_PWM,
				/* Actual period: 0.00007141666666666666 seconds. Actual duty: 49.98833138856476%. */.period_counts =
						(uint32_t) 0x10bd, .duty_cycle_counts = 0x85e,
				.source_div = (timer_source_div_t) 0, .channel = 4,
				.p_callback = NULL,
				/** If NULL then do not add & */
#if defined(NULL)
    .p_context           = NULL,
#else
				.p_context = (void*) &NULL,
#endif
				.p_extend = &g_timer_gpt4_extend, .cycle_end_ipl =
						(BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT4_COUNTER_OVERFLOW)
    .cycle_end_irq       = VECTOR_NUMBER_GPT4_COUNTER_OVERFLOW,
#else
				.cycle_end_irq = FSP_INVALID_VECTOR,
#endif
		};
/* Instance structure to use this module. */
const timer_instance_t g_timer_gpt4 = { .p_ctrl = &g_timer_gpt4_ctrl, .p_cfg =
		&g_timer_gpt4_cfg, .p_api = &g_timer_on_gpt };
gpt_three_phase_instance_ctrl_t g_three_phase0_ctrl;
const three_phase_cfg_t g_three_phase0_cfg = { .buffer_mode =
		(THREE_PHASE_BUFFER_MODE_SINGLE), .p_timer_instance = { &g_timer_gpt4,
		&g_timer_gpt5, &g_timer_gpt6 }, .callback_ch = THREE_PHASE_CHANNEL_U,
		.channel_mask = (1 << 4) | (1 << 5) | (1 << 6), .p_context = NULL,
		.p_extend = NULL, };
/* Instance structure to use this module. */
const three_phase_instance_t g_three_phase0 = { .p_ctrl = &g_three_phase0_ctrl,
		.p_cfg = &g_three_phase0_cfg, .p_api =
				&g_gpt_three_phase_on_gpt_three_phase };
#define RA_NOT_DEFINED (0)

#if (1) // Define Virtual Channel 0 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_0_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_0,

		.channel_cfg_bits.group = (1),
				.channel_cfg_bits.channel = ADC_CHANNEL_0,
				.channel_cfg_bits.differential = 0,
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_is_unsigned = true, };
#endif

#if (1) // Define Virtual Channel 1 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_1_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_1,

		.channel_cfg_bits.group = (1),
				.channel_cfg_bits.channel = ADC_CHANNEL_2,
				.channel_cfg_bits.differential = 0,
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_is_unsigned = true, };
#endif

#if (1) // Define Virtual Channel 2 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_2_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_2,

		.channel_cfg_bits.group = (1),
				.channel_cfg_bits.channel = ADC_CHANNEL_4,
				.channel_cfg_bits.differential = 0,
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_is_unsigned = true, };
#endif

#if (2) // Define Virtual Channel 3 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_3_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_3,

		.channel_cfg_bits.group = (2), .channel_cfg_bits.channel =
				ADC_CHANNEL_27, .channel_cfg_bits.differential = 0,
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_2,

				.channel_control_a_bits.digital_filter_id = 0x0,
				.channel_control_a_bits.offset_table_id =
						ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
				.channel_control_a_bits.gain_table_id =
						ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

				.channel_control_b_bits.addition_average_mode =
						(ADC_B_ADD_AVERAGE_OFF),
				.channel_control_b_bits.addition_average_count =
						ADC_B_ADD_AVERAGE_1,
				.channel_control_b_bits.compare_match_enable = false,

				.channel_control_c_bits.limiter_clip_table_id =
						ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
				.channel_control_c_bits.channel_data_format =
						(ADC_B_DATA_FORMAT_12_BIT),
				.channel_control_c_bits.data_is_unsigned = true, };
#endif

#if (2) // Define Virtual Channel 4 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_4_cfg =
		{ .channel_id = ADC_B_VIRTUAL_CHANNEL_4,

		.channel_cfg_bits.group = (2), .channel_cfg_bits.channel =
				ADC_CHANNEL_28, .channel_cfg_bits.differential = 0,
				.channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_2,

